{
  "id": "09629ec2882445d8a52ffe1adef2e76d",
  "namespace": "7051eadbb8c2435caf32a9bc0dc17936",
  "title": "RimWorld Royalty DLC",
  "description": "The Empire has arrived. Their honor-bound culture wields hyper-advanced technology, while bowing to the ancient traditions of kings and queens. Their grand empire was destroyed by an unknown enemy. Now their refugee fleet settles the rimworld seeking allies.",
  "longDescription": "Their honor-bound culture wields hyper-advanced technology, while bowing to the ancient traditions of kings and queens. Their grand empire was destroyed by an unknown enemy. Now their refugee fleet settles the rimworld, and seeks allies.\n\n# Royal titles\n\nColonists can gain royal titles bestowed by the Empire.\n\nBuild luxurious bedrooms and grand throne rooms for your noble as they rise through the royal ranks. Dress them in finery fit for a king. They'll make speeches from the throne, inspiring or demoralizing your people depending on their abilities. They'll play piano, harp, and harpsichord for pleasure and in concert.\n\nA Knight or Count can call upon the Empire's elite troops in times of need, mentally bond with unique bladelink weapons, and wield psychic abilities.\n\n# Psychic powers\n\nTitles give the right to an Imperial psychic amplifier. Those who hold one can use their mind to manipulate and defeat their foes. Psycasters can blind enemies or mind-control them into taking wrong actions. They can block an ally's sensations of pain or confer deadly focus. Advanced psycasts induce mass vomiting in crowds of foes, teleport objects or people, drive crowds of enemies or herds of animals berserk, or render allies temporarily invisible for stealth attacks.\n\nFor those who wish to live as rebels against the Empire, there are other ways of acquiring psychic amplifiers as well.\n\n# Quests\n\nEarning royal titles means completing quests. Since RimWorld is a story-generation game, quests aren't fixed like in other games. Instead, the system procedurally generates unique quests with every new game. Different goals, foes, guests, rewards, helpers, special threats, and world conditions combine to create endless varied stories and challenges.\n\nQuests will reward you with new allies, unique implants, archotechnological artifacts, gear, royal titles, faction goodwill, and more.\n\n# Mech clusters\n\nMechanoids can now create mechanoid clusters - groups of new mechanoid buildings which work together to present a unique tactical challenge.\n\nMech clusters always appear in an initially dormant state. The player can take the time to decide and execute a plan of attack. This puts the player on the offensive, which contrasts with the defense-oriented fights in the base game.\n\n# Imperial tech\n\nImperial technology mixes ancient weapons and ultratechnology. They wield plasma swords, electrical zeushammers, and hypersharp monoswords. Some of their weapons can speak directly to the wielder through a psychic link. These bladelink weapons are frighteningly effective, but bonding to one is a lifelong commitment. Imperials also have a rich tradition of body implants - neurocalculators, drill arms, gastro-analyzers, skin hardening glands, under-skin weapons, poison attacks, aesthetic enhancements, nuclear stomachs, and love enhancers. You can acquire their techprints and craft all of these.\n\n# New music\n\nThis expansion includes a new full album worth of new music by Alistair Lindsay, composer of the original RimWorld soundtrack.\n\n# Translations\n\n(Since RimWorld translations are fan-made, non-English languages won't be available for the expansion immediately upon release.)",
  "status": "ACTIVE",
  "productSlug": "rimworld/royalty-dlc",
  "urlSlug": "rimworld--royalty-dlc",
  "creationDate": "2020-05-08T20:21:03.080Z",
  "lastModifiedDate": "2020-07-31T02:48:12.214Z",
  "effectiveDate": "2020-06-09T14:00:00.000Z",
  "viewableDate": "2020-06-09T14:00:00.000Z",
  "developer": null,
  "seller": {
    "id": "o-hsdwarj24e4ntqdnvu83854narhusv",
    "name": "Ludeon Studios"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "addons"
    },
    {
      "path": "addons/durable"
    },
    {
      "path": "games"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [],
  "customAttributes": [
    {
      "key": "com.epicgames.app.blacklist",
      "value": "[]"
    },
    {
      "key": "publisherName",
      "value": "Ludeon Studios"
    },
    {
      "key": "com.epicgames.app.productSlug",
      "value": "rimworld/royalty-dlc"
    }
  ],
  "keyImages": [
    {
      "type": "OfferImageTall",
      "url": "https://cdn1.epicgames.com/7051eadbb8c2435caf32a9bc0dc17936/offer/EGS_Royalty_LudeonStudios_DLC_S2-1200x1600-e6e2d5dbcbecf38f58579f10e96550f2.jpg",
      "md5": "e6e2d5dbcbecf38f58579f10e96550f2",
      "size": 644061,
      "uploadedDate": "2020-06-08T18:06:35.493Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "OfferImageWide",
      "url": "https://cdn1.epicgames.com/7051eadbb8c2435caf32a9bc0dc17936/offer/EGS_Royalty_LudeonStudios_DLC_S1-2560x1440-c2d988da3d4ae505be7bc9739515a3ed.jpg",
      "md5": "c2d988da3d4ae505be7bc9739515a3ed",
      "size": 819956,
      "uploadedDate": "2020-06-08T18:06:49.074Z",
      "width": 2560,
      "height": 1440
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/7051eadbb8c2435caf32a9bc0dc17936/offer/EGS_Royalty_LudeonStudios_DLC_S2-1200x1600-e6e2d5dbcbecf38f58579f10e96550f2.jpg",
      "md5": "e6e2d5dbcbecf38f58579f10e96550f2",
      "size": 644061,
      "uploadedDate": "2020-06-08T18:07:08.617Z",
      "width": 1200,
      "height": 1600
    },
    {
      "type": "CodeRedemption_340x440",
      "url": "https://cdn1.epicgames.com/7051eadbb8c2435caf32a9bc0dc17936/offer/EGS_Royalty_LudeonStudios_DLC_S2-1200x1600-e6e2d5dbcbecf38f58579f10e96550f2.jpg",
      "md5": "e6e2d5dbcbecf38f58579f10e96550f2",
      "size": 644061,
      "uploadedDate": "2020-06-08T18:07:22.862Z",
      "width": 1200,
      "height": 1600
    }
  ],
  "items": [
    {
      "id": "f97846ee07fb442d8f1a586842a28c45"
    }
  ],
  "catalogNs": null
}