{
  "id": "8484750561a5445583ba3d1341bc4e43",
  "namespace": "d66c34349a054c3ea529726a5687520e",
  "title": "Wargame Red Dragon - Double Nation Pack: REDS",
  "description": "Yugoslavia & Finland come to reinforce the PACT side of Wargame: Red Dragon, bringing up to 186 new gorgeous units to add further strategic depth to Eugen Systems’ spectacular RTS.",
  "longDescription": "WARGAME: RED DRAGON IS BACK WITH TWO NEW RED NATIONS: YUGOSLAVIA AND FINLAND\n\nYugoslavia & Finland come to reinforce the PACT side of Wargame: Red Dragon, bringing up to 186 new gorgeous units to add further strategic depth to Eugen Systems’ spectacular RTS.\n\nThe Yugoslav People’s Army is a highly-mechanized fighting force, with powerful tanks and IFV backed up by a wide choice of versatile SAM/SPAAG weapon systems as well as many indigenous assault aircrafts. It features four variants of the M-84 MBT as well as heavier tanks such as the M-91 Vihor. Yugoslavia also fields many variants of BOV wheeled armored vehicles, M-60 APV, M-80 IFV… The Yugoslav Air Force introduces no less than four indigenous planes (Jastreb, Super Galeb, Orao & Novi), modeled in-game into seven variants. Yugoslavia is playable in a coalition with Czechoslovakia.\n\nThe Finnish Army is also available in this new Nation Pack. It features excellent reconnaissance, providing a wide array of choices ranging from the stealthy to the powerful. Finland introduces a new unit type: ATV riders, with the FDF Mönkijä, a small & elusive jeep. A strong infantry line-up backs up this recon force, with a large choice of shock troopers & commandos with CQC MG, giving the FDF an uncanny ability at clearing urban areas & woods.\n\nThe Finnish Army’s lineup also features a wide range of tube artillery, from heavy mortars, such as TelaKrH 66, to 122mm PSH 74 (Gvozdika) & 152mm TELAK 91, as well as modernized MBT such as the T-72M1MOD. And let’s not forget the iconic StuG III, a.k.a “Sturmi”!",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "wargame-red-dragon--double-nation-pack-reds",
  "creationDate": "2020-10-15T16:30:54.803Z",
  "lastModifiedDate": "2020-10-29T14:26:21.518Z",
  "effectiveDate": "2099-01-01T00:00:00.000Z",
  "viewableDate": null,
  "developer": null,
  "seller": {
    "id": "o-dcl7pwxvcjx2f42g8sexmmbwjcx44t",
    "name": "Eugen Systems"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [],
  "customAttributes": [
    {
      "key": "com.epicgames.app.blacklist",
      "value": "[]"
    },
    {
      "key": "publisherName",
      "value": "Eugen Systems"
    },
    {
      "key": "developerName",
      "value": "Eugen Systems"
    }
  ],
  "keyImages": [],
  "items": [
    {
      "id": "61ec585351b748f98b2ce0875b99eab5"
    }
  ],
  "catalogNs": null
}