{
  "id": "aed919c9c80441aea2115dbd4c00fd5f",
  "namespace": "d66c34349a054c3ea529726a5687520e",
  "title": "Wargame Red Dragon - Second Korean War",
  "description": "Second Korean War is Wargame: Red Dragon’s second free DLC.\n\nIt features a new solo campaign, set in an uchronical 1992 where the previous year’s coup against Mikhaïl Gorbatchev has succeeded.",
  "longDescription": "_Second Korean War_ is Wargame: Red Dragon’s second free DLC.\n\nIt features a new solo campaign, set in an uchronical 1992 where the previous year’s coup against Mikhaïl Gorbatchev has succeeded. The Party’s old guard has restored Soviet order, getting closer to its Asian communist neighbors in the process, but is set on a confrontational road with the West. And it is only a matter of time before History repeats itself in the Korean peninsula, with China, North Korea & the Soviet Union pitting themselves against a mighty UN coalitions.\n\nSet in W:RD’s future, this massive campaign will see both fielding the very best and most advanced arsenal, in an intense conflict reminiscent of the chaos of World War 2.\n\nBut _Second Korean War_ will also bring you some unexpected multiplayer features, in the form of 12 new units! Those units, one per nation, have been selected among those most requested by the community since the game’s release, or in order to fill some gaps in their home country's deck.\n\n**12 new units:**\n- Marder 2 – Heavily armed and armored tracked troop transport (FRG)\n- Patriot – Heavy anti-aircraft missile (USA)\n- Type 96 – Wheeled troop transport (Japan)\n- VPM-120 – 120mm mortar mounted on a VAB (France)\n- Warrior Milan – Alternate version of the Warrior 90, it is equipped with the MILAN (UK)\n- K9 Thunder – Modern propelled 155mm howitzer (South Korea)\n- M113 Milan – Tank destroyer version of the M113, it is equipped with the MILAN missile (ANZAC)\n- Wolverine – Light anti-aircraft missile, loaded on a very mobile chassis (Canada)\n- M1992 SPAAG – Modern flak vehicle equipped with two 30mm rapid-fire cannons (North Korea)\n- H-5 – Heavy tactical bomber (North Korea)\n- JH-7 – Anti-tank version of the existing JH-7 (China)\n- Spetsnaz GRU – Elite recon infantry (USSR)",
  "status": "ACTIVE",
  "productSlug": null,
  "urlSlug": "wargame-red-dragon--second-korean-war",
  "creationDate": "2020-10-15T16:29:05.108Z",
  "lastModifiedDate": "2020-10-29T14:26:21.509Z",
  "effectiveDate": "2099-01-01T00:00:00.000Z",
  "viewableDate": null,
  "developer": null,
  "seller": {
    "id": "o-dcl7pwxvcjx2f42g8sexmmbwjcx44t",
    "name": "Eugen Systems"
  },
  "linkedOfferId": null,
  "isFeatured": false,
  "ignoreOrder": false,
  "freeDays": 0,
  "collectionOfferIds": [],
  "technicalDetails": null,
  "recurrence": "ONCE",
  "categories": [
    {
      "path": "games"
    },
    {
      "path": "applications"
    }
  ],
  "tags": [],
  "customAttributes": [
    {
      "key": "com.epicgames.app.blacklist",
      "value": "[]"
    },
    {
      "key": "publisherName",
      "value": "Eugen Systems"
    },
    {
      "key": "developerName",
      "value": "Eugen Systems"
    }
  ],
  "keyImages": [],
  "items": [
    {
      "id": "a105527cb0a24c8a8f1691539088acca"
    }
  ],
  "catalogNs": null
}